# Area Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassSurfaceData..::..Area Property
MassSurfaceData Class See Also
---
Area of the references that the MassSurfaceData provides properties for.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double Area { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Area As Double
	Get
```

Visual C++
---
```text
public:
property double Area {
	double get ();
}
```

# Remarks
If it is used, should be greater than zero. Otherwise, it will be zero.
# See Also
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace